# Mission 1

![](https://i.imgur.com/Ax3pp2A.png)


Create a "fruit" dataframe that reflects the above example **using a list** data structure

[This resource could help you](https://datatofish.com/list-to-dataframe/).

In [ ]:
import pandas as pd

In [ ]:
#1 version:

data = [[30,21]]

columns = ["Apples","Bananas"]
index = [0]

df = pd.DataFrame(data,index,columns)
print(df)

   Apples  Bananas
0      30       21

In [ ]:
# 2 version compresed:
list_name = [[30,21]]
df = pd.DataFrame(list_name,columns = ["Apples","Bananas"],index = [0])

print(df)

   Apples  Bananas
0      30       21

# Mission 2

Create a "fruit_vendors" dataframe that reflects the below example **using a dictionary** data structure

![](https://i.imgur.com/CHPn7ZF.png)

[This resource could help you.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.from_dict.html)

In [ ]:
data = {"2017 Sales" : [35,41],"2018 Sales":[21,34]}
pd.DataFrame.from_dict(data,orient="index",
                      columns = ["Apples","Bananas"])

            Apples  Bananas
2017 Sales      35       41
2018 Sales      21       34

# Mission 3

Use a loop to display the values from each column in the dataframe from mission 2.

In [ ]:
data = {"2017 Sales" : [35,41],"2018 Sales":[21,34]}
pd.DataFrame.from_dict(data,orient="index",
                      columns = ["Apples","Bananas"])

for index,row in df.iterrows():
    print(row["2017 Sales"],row["2018 Sales"])

35 21
41 34

# Mission 4

Delete the first row of the dataframe from mission 2

[This resource could help you.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

In [ ]:
data = {"2017 Sales" : [35,41],"2018 Sales":[21,34]}
df = pd.DataFrame.from_dict(data,orient="index",
                      columns = ["Apples","Bananas"])


df.drop(index=["2017 Sales"])

            Apples  Bananas
2018 Sales      21       34

# Mission 5

Delete the first column from the dataframe from mission 2.

In [ ]:
data = {"2017 Sales" : [35,41],"2018 Sales":[21,34]}
df = pd.DataFrame.from_dict(data,orient="index",
                      columns = ["Apples","Bananas"])


df.drop(columns=["Apples"])

            Bananas
2017 Sales       41
2018 Sales       34